## Scratch: rds
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_subnet_group.forms will be created
  + resource "aws_db_subnet_group" "forms" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "forms-scratch-db"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0434222e4402d3250",
          + "subnet-09c3ce9dd3c216b1a",
          + "subnet-0e59716b8f5291336",
        ]
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms-scratch-db"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms-scratch-db"
          + "Terraform"  = "true"
        }
    }

  # aws_rds_cluster.forms will be created
  + resource "aws_rds_cluster" "forms" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 5
      + cluster_identifier              = "forms-db-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "forms"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "forms-scratch-db"
      + deletion_protection             = true
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = true
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "serverless"
      + engine_version                  = (known after apply)
      + engine_version_actual           = (known after apply)
      + final_snapshot_identifier       = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "postgres"
      + port                            = (known after apply)
      + preferred_backup_window         = "07:00-09:00"
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags                            = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms-db-cluster"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms-db-cluster"
          + "Terraform"  = "true"
        }
      + vpc_security_group_ids          = [
          + "sg-094061e4f920acf39",
        ]

      + scaling_configuration {
          + auto_pause               = false
          + max_capacity             = 8
          + min_capacity             = 2
          + seconds_until_auto_pause = 300
          + timeout_action           = "RollbackCapacityChange"
        }
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
